Revit 2026 API

# CheckerCheckerColor2 Property

---

The property labeled "Color 2" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CheckerColor2 { get; }
```
```vb
Public Shared ReadOnly Property CheckerColor2 As String
	Get
```
```cpp
public:
static property String^ CheckerColor2 {
	String^ get ();
}
```
```fsharp
static member CheckerColor2 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace